{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/yoshikinakajima/Documents/GitHub/microeconometrics/ex2.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}17 Jul 2018, 16:37:59
{txt}
{com}. 
. use "~/Documents/GitHub/microeconometrics/assignment_DiD1.dta", clear
{txt}
{com}. 
. 
. *******************
. **** Part1 ********
. *******************
. 
. 
. *** Q1 ***
. reg ly d t if x==1, robust 

{txt}Linear regression                               Number of obs     = {res}    19,762
                                                {txt}F(2, 19759)       =  {res}  2475.98
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1977
                                                {txt}Root MSE          =    {res}  .9619

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          ly{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}d {c |}{col 14}{res}{space 2} 1.078351{col 26}{space 2} .0153281{col 37}{space 1}   70.35{col 46}{space 3}0.000{col 54}{space 4} 1.048306{col 67}{space 3} 1.108395
{txt}{space 11}t {c |}{col 14}{res}{space 2}-.0241081{col 26}{space 2} .0136847{col 37}{space 1}   -1.76{col 46}{space 3}0.078{col 54}{space 4}-.0509314{col 67}{space 3} .0027151
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8370638{col 26}{space 2} .0104176{col 37}{space 1}   80.35{col 46}{space 3}0.000{col 54}{space 4} .8166445{col 67}{space 3} .8574832
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. *** Q2 ***
. ** 2-1
. egen y11 = mean(ly) if x==1 & sub==1 & t==1
{txt}(49384 missing values generated)

{com}. egen y10 = mean(ly) if x==1 & sub==1 & t==0
{txt}(49386 missing values generated)

{com}. egen y01 = mean(ly) if x==1 & sub==0 & t==1
{txt}(40893 missing values generated)

{com}. egen y00 = mean(ly) if x==1 & sub==0 & t==0
{txt}(40575 missing values generated)

{com}. 
. egen y11m = mean(y11)
{txt}
{com}. egen y10m = mean(y10)
{txt}
{com}. egen y01m = mean(y01)
{txt}
{com}. egen y00m = mean(y00)
{txt}
{com}. 
. gen itt1 = (y11m - y10m) - (y01m  - y00m)
{txt}
{com}. gen itt2 = (y11m - y01m) - (y10m  - y00m)
{txt}
{com}. display itt1 itt2
{res}.18904054.18904054
{txt}
{com}. ** 2-2
. gen tsub = t*sub
{txt}
{com}. reg ly t sub tsub if x==1, robust

{txt}Linear regression                               Number of obs     = {res}    19,762
                                                {txt}F(3, 19758)       =  {res}    12.93
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0020
                                                {txt}Root MSE          =    {res} 1.0729

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          ly{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}t {c |}{col 14}{res}{space 2}-.0087833{col 26}{space 2} .0157474{col 37}{space 1}   -0.56{col 46}{space 3}0.577{col 54}{space 4}-.0396496{col 67}{space 3}  .022083
{txt}{space 9}sub {c |}{col 14}{res}{space 2} .0795828{col 26}{space 2} .0459049{col 37}{space 1}    1.73{col 46}{space 3}0.083{col 54}{space 4}-.0103947{col 67}{space 3} .1695602
{txt}{space 8}tsub {c |}{col 14}{res}{space 2} .1890406{col 26}{space 2} .0642405{col 37}{space 1}    2.94{col 46}{space 3}0.003{col 54}{space 4} .0631239{col 67}{space 3} .3149573
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.107719{col 26}{space 2} .0109938{col 37}{space 1}  100.76{col 46}{space 3}0.000{col 54}{space 4}  1.08617{col 67}{space 3} 1.129268
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. *** Q3 ***
. **3-1
. reg ly t if x==1 & sub==0, robust

{txt}Linear regression                               Number of obs     = {res}    18,532
                                                {txt}F(1, 18530)       =  {res}     0.31
                                                {txt}Prob > F          = {res}    0.5770
                                                {txt}R-squared         = {res}    0.0000
                                                {txt}Root MSE          =    {res} 1.0715

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          ly{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}t {c |}{col 14}{res}{space 2}-.0087833{col 26}{space 2} .0157467{col 37}{space 1}   -0.56{col 46}{space 3}0.577{col 54}{space 4}-.0396483{col 67}{space 3} .0220817
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.107719{col 26}{space 2} .0109933{col 37}{space 1}  100.76{col 46}{space 3}0.000{col 54}{space 4} 1.086171{col 67}{space 3} 1.129267
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. ** 3-2
. egen p10 = mean d_uS if t==0 /*& x==1*/ // x==1 is not necesarry under no time trend
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "/var/folders/g9/ny0mk9fn6_71rdqwld__d77r0000gn/T//SD43875.000000"
{txt}
{com}. ** 3-2
. egen p10 = mean d_uS if t==0 /*& x==1*/ // x==1 is not necesarry under no time trend
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. 
. 
. 
. 
. do "/var/folders/g9/ny0mk9fn6_71rdqwld__d77r0000gn/T//SD43875.000000"
{txt}
{com}. summarize d_uS if t==0 & x ==1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}d_uS {c |}{res}     10,039    .2783146    .4481915          0          1
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/g9/ny0mk9fn6_71rdqwld__d77r0000gn/T//SD43875.000000"
{txt}
{com}. egen p10 = r(mean) if x==1
{err}unknown egen function r()
{txt}{search r(133), local:r(133);}

end of do-file

{search r(133), local:r(133);}

{com}. do "/var/folders/g9/ny0mk9fn6_71rdqwld__d77r0000gn/T//SD43875.000000"
{txt}
{com}. gen p10 = r(mean) if x==1
{txt}(50,000 missing values generated)

{com}. 
{txt}end of do-file

{com}. help pstest

. do "/var/folders/g9/ny0mk9fn6_71rdqwld__d77r0000gn/T//SD43875.000000"
{txt}
{com}. capture log close
{smcl}
{com}{sf}{ul off}